from aiogram.enums.parse_mode import ParseMode

"""
Полезные ссылки:
https://mastergroosha.github.io/aiogram-3-guide/messages/
"""

# HTML/MARKDOWN/MARKDOWN_V2
PARSE_MODE = ParseMode.HTML

MAIN_MENU_PHOTO = "https://images-ext-2.discordapp.net/external/5Ot5IZTGCM6els5VL1jqM7M6LvFjvweyHghrsYuWVEc/https/4.bp.blogspot.com/-Q4M-cdQrr4k/V2KOyUiT5tI/AAAAAAAAmVg/apyUhhyjF4Idk2tv-4V4pMeYw8tHKz1qQCKgB/s1600/Serp-i-molot.png?width=1228&height=1228"
MAIN_MENU = """
<b>Вызовы XX века</b>

<i>«Социалистический»</i> и <i>«капиталистический»</i> город в осмыслении советских архитекторов и публицистов.
"""

SOCIAL_CITY_PHOTO = "https://media.discordapp.net/attachments/1163560977120378991/1163580601014689832/i.jpeg?ex=654017e1&is=652da2e1&hm=3beed412daf3030f0836bf9fd03850f8ddaccfc26092d281a0b6d425b0795762&=&width=1666&height=1228"
SOCIAL_CITY = """
<b>Социалистический город</b>
"""

CAPITAL_CITY_PHOTO = "https://media.discordapp.net/attachments/1163560977120378991/1163592895568289843/14-bonart-125.jpg?ex=65402354&is=652dae54&hm=fc4b7715d57b8bcc55868eca1e8c4f0c70b03cdf243a407aa20ffac06ef693b9&=&width=2000&height=1174"
CAPITAL_CITY = """
<b>Капиталистический город</b>
"""

COMPARE_ANALYTICS = """
<b>Сравнительный анализ</b>

Организация как экономики, так и городского устройства в социалистическом городе носила плановый характер и регулировалась государством. В капиталистическом городе 
экономика основана на свободной конкуренции и направлена на получение прибыли. Из-за этого условия труда ухудшаются, многие сферы подвергаются коммерциализации. Среди городских жителей выделяются обладатели капитала, между которыми распределяется большая часть богатств. Это приводит к изменению социального состава определенных районов, когда состоятельные слои населения переселяются в более элитарные по какому-либо признаку места. Одновременно с этим их места занимают мигранты, для которых капиталистический город является возможностью больше заработать. В социалистическом городе жилье, общественные службы и места работы распределялись равномерно, чтобы человек тратил меньше времени на дорогу до работы и других важных социальных мест.

В нашей стране типичным примером капиталистического города является Москва. Здесь явно видно разделение районов и административных округов на более и менее элитарные, выделяются районы с большим количеством мигрантов. Сравнивая столицу с другими городами можно сделать вывод, что социальная дифференциация в них не так распространена, как в Москве.
"""

SOURCES = """
https://t.me/bykhadzakos
https://t.me/d0gied_channel
"""


### SOCIAL CITY

SOCIAL_INFO_PHOTO = "https://media.discordapp.net/attachments/1163560977120378991/1163576452743184425/og_1570507497222911994.jpg?ex=65401404&is=652d9f04&hm=2a56a22026c7b9b595c1b3a3d0d5e27b2095381f5200a90cfbe32f2e7cd90038&=&width=2268&height=1186"
SOCIAL_INFO = f"""
<b>Социалистический город. Общая информация</b>

Соцгорода (<i>сокращение от "социалистический город"</i>) в СССР представляли собой особого рода населенные пункты, в которых реализовывались принципы социалистической экономики и социальной политики. Эти города были созданы в период с <i>1930-х</i> по <i>1950-е</i> годы и представляли собой своего рода лаборатории, где внедрялись новые методы планирования и управления, а также методы организации жизни советского человека. Соцгорода предполагали максимальную интеграцию жилых, рабочих и общественных функций. Это означало, что городские планировщики старались уменьшить разделение рабочих и жилых районов, чтобы сократить необходимость в транспорте и обеспечить доступность всех услуг для жителей. Архитектура соцгородов часто была вдохновлена советским конструктивизмом, функционализмом и другими современными стилями. Здания были часто многоэтажными и удобными, но также могли иметь характерные элементы, отражающие советскую идеологию.
"""

SOCIAL_AREA_PLANING_PHOTO = "https://media.discordapp.net/attachments/1163560977120378991/1163568088499884102/code_block_Social_City_Space_Organization.jpeg?ex=65400c3a&is=652d973a&hm=9164572be70b79292b17843513622b587b289129d80bbbdfab27e1c3ad9b5bed&=&width=1636&height=1228"
SOCIAL_AREA_PLANING = """
<b>Социалистический город. Организация пространства.</b>

Социалистический город организовывал пространство с учетом принципов равенства и социальной справедливости. Он стремился создать равные условия для всех жителей, минимизировать социальные неравенства и обеспечить доступность общественных благ.

В социалистическом городе пространство планировалось таким образом, чтобы обеспечить равномерное распределение жилья, общественных служб и инфраструктуры. Жилые районы строились с учетом принципа близости к месту работы и доступности общественного транспорта. Маршруты общественного транспорта составлялись с учетом сокращения времени на дорогу от дома до места работы.  Были созданы многофункциональные микрорайоны, в которых находились магазины, школы, детские сады, поликлиники и другие социальные учреждения.

В социалистическом городе также уделялось внимание развитию общественных пространств, таких как парки, скверы, спортивные площадки и культурные центры.

В целом, социалистический город организовывался с учетом потребностей и интересов коллектива, с целью обеспечить равные возможности и продуктивность производства.
"""

SOCIAL_CULTURE_PHOTO = "https://media.discordapp.net/attachments/1163560977120378991/1163569932383031407/UpaTWhJ2OEE.jpg?ex=65400df1&is=652d98f1&hm=9cfe57fc8012fbb2f51912e316c62f050d0b7d747d9eab8fd3327d492b684779&=&width=2152&height=1228"
SOCIAL_CULTURE = """
<b>Социалистический город. Культура.</b>

В соцгородах активно создавались культурные учреждения, такие как клубы, кинотеатры, библиотеки. Эти учреждения были не просто местами отдыха, но и инструментами пропаганды идеологии социализма.  В кинематографе, литературе и изобразительном искусстве активно использовались образы рабочих, крестьян и советских лидеров. Это помогало формировать идеальные представления о социалистическом обществе. Школы и другие учебные заведения в соцгородах также играли роль в пропаганде, обучая детей идеологии социализма и высоким идеалам коммунизма.

Соцгород был не только местом жизни рабочего класса, но и мощным инструментом пропаганды, через который СССР пытался создать новое социалистическое общество, где культура и идеология были тесно связаны. 
"""

SOCIAL_ECONOMY_PHOTO = "https://media.discordapp.net/attachments/1163560977120378991/1163572245147426856/Jelektrodnyj_Ceh_1959.jpg?ex=65401019&is=652d9b19&hm=d6a7a41e917e663d88da3d62064996b6543512cde21bb89b5b10d8e3a70a98c0&=&width=1918&height=1228"
SOCIAL_ECONOMY = """
<b>Социалистический город. Экономика.</b>

Организация экономики в соцгородах имела свои особенности, и она была сильно централизованной и планируемой.

В соцгородах применялась централизованная плановая экономика, где государство контролировало и регулировало большую часть производства и распределения ресурсов. 

Основные предприятия и ресурсы, такие как заводы, шахты, сельское хозяйство и инфраструктура, находились в государственной собственности. Многие соцгорода были обязаны самофинансироваться, то есть, они должны были создавать доходы из своей экономической деятельности и передавать их в бюджет города и области. В соцгородах часто была высокая занятость, поскольку государство старалось обеспечить рабочие места для населения. Планирование экономики включало в себя усилия по стандартизации и равномерному развитию различных секторов экономики и регионов.

Соцгорода часто строились в отдаленных районах, где раньше не было крупных городов, и они служили целям индустриализации, а также социальной и экономической модернизации страны. Однако этот модель социалистического города имела свои ограничения и недостатки, и она была связана с проблемами эффективности и инноваций в экономике. С концом Советского Союза и распадом коммунистических режимов в Восточной Европе, многие соцгорода столкнулись с экономическими и социальными вызовами. 
"""

SOCIAL_SOCIAL_POLICY_PHOTO = "https://media.discordapp.net/attachments/1163560977120378991/1163579792533225523/1526466826_mrntl8am-zm.jpg_-_Social_City.jpg?ex=65401720&is=652da220&hm=1888b089170a93b5d5eab27e6dc5ccc0698eb9c10414346dfd2e7ab753ce9543&=&width=1602&height=1228"
SOCIAL_SOCIAL_POLICY = """
<b>Социалистический город. Социальная политика.</b>

В соцгородах активно развивалась промышленность, строительство и другие секторы экономики, что создавало рабочие места для местных жителей. Государство обеспечивало стабильность занятости и определенные социальные гарантии для работников. В соцгородах существовали бесплатные школы и медицинские учреждения, обеспечивающие доступ к образованию и медицинской помощи для всех граждан. Государство также строило множество жилых домов и квартир для работников соцгородов. В соцгородах развивались культурные и спортивные учреждения, общественный транспорт и общественные кафе.

Главное - соцгородах проводилась агитационная и пропагандистская работа среди населения в духе социалистической идеологии.

Однако стоит отметить, что соцгорода часто страдали от недостатка свободного рынка и бюрократии, что приводило к некоторым ограничениям в выборе и доступности товаров и услуг. В конечном итоге, идея соцгородов в СССР была частично заменена более легкими формами социальной политики в более поздние годы, но оставила следы в истории и культуре страны.
"""


### CAPITAL CITY

CAPITAL_INFO_PHOTO = "https://media.discordapp.net/attachments/1163560977120378991/1163595383549730887/Capitalist_City_20th_Century.jpg?ex=654025a5&is=652db0a5&hm=6280322cff195534c151055ae3714041822195f5057d2856c9098421f3e58fb0&=&width=2172&height=1228"
CAPITAL_INFO = f"""
<b>Капиталистический город. Общая информация.</b>

<i>Капиталистический город</i> - это город, в котором основной экономический и социальный порядок основан на принципах капитализма. Такого вида города город функционируют на основе рыночной экономики, где товары и услуги производятся, распределяются и обмениваются на основе спроса и предложения. Рыночные механизмы играют важную роль в принятии экономических решений, определении цен и стимулировании конкуренции. Конкуренция между фирмами стимулирует инновации, снижение цен, улучшение качества товаров и услуг. Предприниматели имеют возможность создавать и управлять собственными бизнесами, преследуя свои финансовые и карьерные цели. Капиталистические города могут отличаться по своему уровню развития, размеру, специализации отраслей экономики и другим факторам. Однако, общая черта таких городов - основная роль экономики и бизнеса в формировании их структуры и жизни общества.
"""

CAPITAL_AREA_PLANING_PHOTO = "https://media.discordapp.net/attachments/1163560977120378991/1163589986399031296/Capitalist_City.jpg?ex=6540209f&is=652dab9f&hm=17034a8b0618aa1ca57ff07d4abee1f46a36485281902cbc7268efb2408b2c2b&=&width=1584&height=1228"
CAPITAL_AREA_PLANING = """
<b>Капиталистический город. Организация пространства.</b>

Мнение советских архитекторов организации пространства в капиталистическом городе объективно сложно описать, так как они имели ограниченный доступ к информации о городах стран с капиталистической экономикой. Советские архитекторы противопоставляли капиталистические города, где существует явное разделение на богатые и бедные районы. Они считали, что такое разделение создает социальную напряженность и неравенство, что отражается в организации пространства. Критиковали низкую плотность застройки в капиталистических городах. Они утверждали, что это способствует разобщенности и ограниченной доступности к инфраструктуре и общественным пространствам, таким как парки и скверы. Также часто упоминали коммерциализацию общественных пространств в капиталистических городах. Они считали, что частные интересы и финансовые выгоды занимают первоочередное место перед обеспечением доступа общественности к качественным и разнообразным пространствам.
"""

CAPITAL_CULTURE_PHOTO = "https://media.discordapp.net/attachments/1163560977120378991/1163585977428750336/7ba2b3011378a517470f2d206eae25e8.jpeg?ex=65401ce3&is=652da7e3&hm=1c02505f769d7fc64bc98132ac1896f0524527818b761614231a0112cc311bce&=&width=1544&height=1228"
CAPITAL_CULTURE = """
<b>Капиталистический город. Культура.</b>

Советские идеологи осуждали распространение коммерческой культуры, где искусство, музыка, кино и другие формы развлечений становились товаром, созданным для получения прибыли. Это, по их мнению, приводило к потере истинных ценностей и культурного вырождения.

Город в капиталистической системе виделся советскими публицистами как место, где люди часто чувствуют себя одинокими и изолированными из-за отсутствия тесных социальных связей. Это связывалось с отчуждением, которое, по их мнению, было результатом капиталистических отношений. Такого вида города виделись как место, где ценности сводятся к потреблению материальных благ. Это, по их мнению, приводило к поверхностным ценностям, ориентированным на накопление вещей, вместо более глубоких духовных и культурных аспектов жизни. Советские публицисты также критиковали капитализм за его воздействие на окружающую среду.
"""

CAPITAL_ECONOMY_PHOTO = "https://media.discordapp.net/attachments/1163560977120378991/1163591718344597504/Scale_1200.jpeg?ex=6540223c&is=652dad3c&hm=881ebd2305504d8d33b636d100fc8300a1b5fd878ab8fe73d530d97527a25779&=&width=1908&height=1228"
CAPITAL_ECONOMY = """
<b>Капиталистический город. Экономика.</b>

Экономика капиталистического города рассматривалась советскими публицистами из-за противопоставления его принципам социалистической экономики, которая строилась в Советском Союзе.

Советские публицисты часто выдвигали идею, что капиталистическая экономика основана на свободной конкуренции и прибыли, что позволяет капиталистам эксплуатировать рабочих. Они утверждали, что рабочие получают низкую заработную плату, а условия труда часто неудовлетворительны. Также они критиковали неравномерное распределение богатства в капиталистическом городе. Они считали, что капиталистическая система способствует накоплению богатства в руках немногих, в то время как большинство населения испытывает недостаток и социальные проблемы. Указывали на то, что в капиталистическом городе все становится объектом коммерческой эксплуатации. Они утверждали, что даже такие важные сферы, как здравоохранение, образование и культура, подвергаются коммерциализации, что снижает качество услуг и доступность для масс. Советские публицисты отмечали, что капитализм создает общество, где деньги играют центральную роль. Они утверждали, что такая система приводит к потребительскому образу мышления, где важны необходимость постоянного приобретения материальных благ и накопления богатства.

Важно отметить, что мнения советских публицистов отражали идеологическую позицию Советского Союза и не всегда были объективными. Они представляли точку зрения, противопоставленную капитализму и отражали приоритеты социалистической системы.
"""

CAPITAL_SOCIAL_POLICY_PHOTO = "https://media.discordapp.net/attachments/1163560977120378991/1163593140574367825/Capitalist_City_Parade_Retro_Street.jpg?ex=6540238f&is=652dae8f&hm=6246a04d270c3d4e5b5302e7e915686a7607f44ab8c669e6b76b799f9470a092&=&width=1820&height=1228"
CAPITAL_SOCIAL_POLICY = """
<b>Капиталистический город. Социальная политика</b>

Советские публицисты критически относились к социальной политике капиталистического города. 

Утверждалось, что капиталистический город сосредотачивает свое внимание на экономической эффективности и индивидуальных достижениях, оставляя в стороне социальные программы и заботу о слабых и уязвимых группах населения. Публицисты указывали на нестабильность и низкую защищенность трудящихся в капиталистическом городе. Они говорили о отсутствии гарантированного дохода, непостоянстве занятости, негативных последствиях увольнений и возможности падения социального статуса из-за экономических факторов. Также они критиковали ограниченность и неравномерность доступа к социальным услугам, таким как образование, здравоохранение и жилье. Они считали, что в капиталистическом городе эти услуги становятся привилегией небольшой группы, а не правом всех граждан.
"""
