from aiogram.enums.parse_mode import ParseMode

"""
Полезные ссылки:
https://mastergroosha.github.io/aiogram-3-guide/messages/
"""

# HTML/MARKDOWN/MARKDOWN_V2
PARSE_MODE = ParseMode.HTML
IMAGES_PATH = "images/"

# Если хочешь именить название переменной - оставь комментарий
# Пример: MENU_1 = "..." #TODO MENU_1 -> SOCIAL_TEXT

# Картинки сохраняй в папку images и создавай здесь переменную с путем (пример: IMG_MAIN_MENU= "main_menu.png")
# И оставляй TODO для добавления, картинки пиши рядом с текстом этого соощения,
# пояснения к визуализации (например раздельные сообщения на одной странице) поясняй в комментариях

MAIN_MENU = """
<b>Главное меню</b>
"""

SOCIAL_CITY = """
<b>Меню 1</b>
"""

CAPITAL_CITY = """
<b>Меню 2</b>
"""

COMPARE_ANALYTICS = """
<b>Меню 3</b>
"""

SOURCES = """
https://t.me/bykhadzakos
https://t.me/d0gied_channel
"""

### SOCIAL CITY

SOCIAL_AREA_PLANING_PHOTO = "https://media.discordapp.net/attachments/1163560977120378991/1163562325190639759/1526466826_mrntl8am-zm.jpg_-_Social_City.jpg?ex=654006dc&is=652d91dc&hm=eb69057f1d43fd002bae547b55359140ba3a231034390aa98d73fa8aaa748702&=&width=1602&height=1228"
SOCIAL_AREA_PLANING = """
<b>Социалистический город. Организация пространства.</b>

Социалистический город организовывал пространство с учетом принципов равенства и социальной справедливости. Он стремился создать равные условия для всех жителей, минимизировать социальные неравенства и обеспечить доступность общественных благ.

В социалистическом городе пространство планировалось таким образом, чтобы обеспечить равномерное распределение жилья, общественных служб и инфраструктуры. Жилые районы строились с учетом принципа близости к месту работы и доступности общественного транспорта. Были созданы многофункциональные микрорайоны, в которых находились магазины, школы, детские сады, поликлиники и другие социальные учреждения.

В социалистическом городе также уделялось внимание развитию общественных пространств, таких как парки, скверы, спортивные площадки и культурные центры. Эти места предназначались для отдыха, развлечений и культурного обогащения жителей.

Организация пространства в социалистическом городе также включала развитие общественного транспорта и создание удобной системы передвижения. Были строены метро, трамваи и автобусные маршруты, чтобы обеспечить доступность для всех жителей города.

В целом, социалистический город организовывался с учетом потребностей и интересов коллектива, с целью обеспечить равные возможности и продуктивность производства.
"""

SOCIAL_CULTURE_PHOTO = "https://media.discordapp.net/attachments/1163560977120378991/1163568088499884102/code_block_Social_City_Space_Organization.jpeg?ex=65400c3a&is=652d973a&hm=9164572be70b79292b17843513622b587b289129d80bbbdfab27e1c3ad9b5bed&=&width=1636&height=1228"
SOCIAL_CULTURE = """
<b>Социалистический город. Культура.</b>

В соцгородах активно создавались культурные учреждения, такие как клубы, кинотеатры, библиотеки. Эти учреждения были не просто местами отдыха, но и инструментами пропаганды идеологии социализма.  В кинематографе, литературе и изобразительном искусстве активно использовались образы рабочих, крестьян и советских лидеров. Это помогало формировать идеальные представления о социалистическом обществе. Школы и другие учебные заведения в соцгородах также играли роль в пропаганде, обучая детей идеологии социализма и высоким идеалам коммунизма.

Соцгород был не только местом жизни рабочего класса, но и мощным инструментом пропаганды, через который СССР пытался создать новое социалистическое общество, где культура и идеология были тесно связаны. 
"""

SOCIAL_ECONOMY = """
<b>Меню 1.3</b>
"""

SOCIAL_SOCIAL_POLICY = """
<b>Меню 1.4</b>
"""

### CAPITAL CITY

CAPITAL_AREA_PLANING = """
<b>Меню 2.1</b>
"""

CAPITAL_CULTURE = """
<b>Меню 2.2</b>
"""

CAPITAL_ECONOMY = """
<b>Меню 2.3</b>
"""

CAPITAL_SOCIAL_POLICY = """
<b>Меню 2.4</b>
"""
